app/Controllers/Home.php

    public function index()
    {
        // var_dump($this->db);

        $jobs_details = $this->jobs_details->like('created_date', '2022-04-%')->get()->getResultArray();
---
SELECT *
FROM `jobs_details`
WHERE `created_date` LIKE '%2022-04-%%' ESCAPE '!'